# CanRemoveElementsFromAssembly Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyInstance..::..CanRemoveElementsFromAssembly Method
AssemblyInstance Class See Also
---
Identifies if provided assembly members can be removed from the assembly instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static bool CanRemoveElementsFromAssembly(
	AssemblyInstance assemblyInstance,
	ICollection<ElementId> memberIds
)
```

Visual Basic
---
```text
Public Shared Function CanRemoveElementsFromAssembly ( _
	assemblyInstance As AssemblyInstance, _
	memberIds As ICollection(Of ElementId) _
) As Boolean
```

Visual C++
---
```text
public:
static bool CanRemoveElementsFromAssembly(
	AssemblyInstance^ assemblyInstance,
	ICollection<ElementId^>^ memberIds
)
```

# ### Parameters
assemblyInstance
    Type: Autodesk.Revit.DB..::..AssemblyInstance The assembly instance to remove elements from.
memberIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> Element ids to be tested for validity to remove from the assembly instance.
# ### Return Value
True if all member ids are valid, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AssemblyInstance Class
Autodesk.Revit.DB Namespace